; TaskSwitchXP Pro 2.05 English Language File (Template)
; Translated by Alexander Avdonin <alexander@ntwind.com>


; TaskSwitchXP enumerates all *.LNG files into .\lang subfolder!
; To add a language for TaskSwitchXP:
;     1) translate this file;
;     2) save it as <NewLanguage>.lng in UNICODE format
;        (for Notepad: select File->Save_As and then choose Unicode encoding);
;     3) test it before submitting!!!
;
; Translations forum/tracker: http://www.ntwind.com/forum/viewforum.php?f=3
;
; I will include some translations to my official release (if you accept!)...
; Please put your e-mail address for feedback somewhere!


; There are a few special characters (two symbols are recognized as one):
;     1) carriage return and new line:  \r\n
;     2) tab:  \t
;     3) quotation mark:  \"
;     4) back slash:  \\


; NOTE: These language files will generally work with future versions of 
;       TaskSwitchXP, but some strings will appear in English. I will put a 
;       change log for future versions in the comments of this file.


; Currently TaskSwitchXP uses *.LNG file names for language identifying.
; This string is ignored. Please put here for future versions:
;     19999="English_LanguageName (Native_LanguageName)"
;     e.g. 19999="German (Deutsch)"
19999="Italian (Italiano)"


; Configuration
20000="Configurazione TaskSwitchXP Pro 2.0"
20001="OK"
20002="Annulla"
20003="Applica"

; Filters
20031="File configurazione TaskSwitchXP (*.cfg)"


; Pages
20050="Generale"
20051="Aspetto"
20052="Lista applicazioni"
20053="Anteprima"
20054="Informazioni applicazioni"
20055="Hotkeys"
20056="Esclusioni"
20057="Avanzati"
20058="Informazioni"

; Page descriptions
20070="Settaggi generali"
20071="Settaggi aspetto"
20072="Lista applicazioni"
20073="Settaggi anteprima"
20074="Informazioni applicazioni"
20075="Hot Keys TaskSwitchXP"
20076="Esclusioni TaskSwitchXP"
20077="Settaggi avanzati"
20078="Informazioni su TaskSwitchXP"


; General page
20100="Linguaggio:"
20101="<a id=\"idLang\" href=\"\">Cerca altre traduzioni...</a>"
20102="Usa settaggi differenti per ogni utente del sistema"
20103="Esecuzione automatica di TaskSwitchXP all'avvio del sistema"
20104="Attiva priorità alta per TaskSwitchXP"
20105="Controlla se Ms PowerToy TaskSwitcher è in esecuzione"
20106="Icone del Tray:"
20107="Mostra l'icona di TaskSwitchXP nel system tray all'avvio"
20108="Usa icona personalizzata:"
20109="Riduci le finestre nel tray con right-click sul pulsante Minimize"
20110="Escludi le icone del tray di TaskSwitchXP dalla riduzione automatica di WinXP"
20111="Aggiungi finestre minimizzate nel tray alla fine della lista Alt-Tab"

20120="Ripristina i defaults"
20121="Carica..."
20122="Salva..."

; Appearance page
20200="Posizione sullo schermo:"
20201="Mostra sul monitor attivo"
20202="Mostra ombra per la finestra TaskSwitchXP"
20203="Attiva trasparenza per la finestra TaskSwitchXP:"
20204="Attiva animazione di fade in (in millisecondi):"
20205="Attiva animazione di fade out (in millisecondi):"
20206="Visualizzazione preferita:"
20207="Stile XP Visual:"
20208="Stile Classico:"
20209="Forza l'uso dello stile Classico TaskSwitchXP"
20210="Scambia ordine pannelli Lista-Anteprima"

; Position on screen
20270="In alto a sinistra"
20271="In alto al centro"
20272="In alto a destra"
20273="Centrato a sinistra"
20274="A centro schermo"
20275="Centrato a destra"
20276="In basso a sinistra"
20277="In basso al centro"
20278="In basso a destra"

; Modern XP skins
20280="Stile Start Panel (default)"
20281="Stile PowerToy TaskSwitcher"
20282="Stile Window semplice"
20283="Stile XP Flat"
20284="Stile XP Soft"
20285="Stile TaskBar"

; Classical skins
20290="Stile Start Panel (default)"
20291="Stile Start Panel Flat"


; Task List page
20300="Visualizzazione lista:"
20301="Numero di colonne:"
20302="Largh. (in pixels):"
20303="Numero di linee:"
20304="Icone piccole"
20305="Attiva tooltips per la lista icone"
20306="Attiva cursore mano per oggetti selezionabili"
; or something like 20307="Enable mouse over selection", 
; I've translated it to Russian as: 20307="Select list item under cursor"
20307="Attiva selezione mouse over"
20308="Inverti mouse wheel"
20309="Stile selezione:"
20310="Disegna rettangolo focus"
20311="Stile e colori del test:"
20312="Stile:"
20313="Dim.:"
20314="B"
20315="I"
20316="Indice colore:"

; List views
20390="Icone"
20391="Lista verticale"

; Selection styles
20380="Riquadro"
20381="Rettangolo pieno"
20382="Rettangolo arrotondato"

; Color indexes
20370="Testo normale"
20371="Testo selezionato"
20372="Sfondo selezione"
20373="Testo marcato 1"
20374="Sfondo marcato 1"
20375="Testo marcato 2"
20376="Sfondo marcato 2"


; Preview page
20400="Stile anteprima:"
20401="Stile anteprima \"Desktop\""
20402="Stile anteprima \"Window\""
20403="Includi la taskbar di Windows nell'anteprima"
20404="Disegna solo l'ultima popup dell'applicazione"
20405="Non disegnare il wallpaper del desktop nell'anteprima (a-la v1.0)"
20406="Usa il wallpaper del desktop come sfondo"
20407="Disegna bordo attorno all'immagine di anteprima"
20408="Centra l'immagine di anteprima verticalmente"
20409="Mostra i titoli delle finestre minimizzate nell'anteprima (*)"
20410="Escludi tutte le finestre a livelli dall'anteprima (*)"
20411="Ampiezza dell'immagine di anteprima (in pixels):"
20412="Ritardo nella prima generazione di anteprima (in millisecondi):"
20413="Non usare cache immagini di anteprima"
20414="Attiva aggiornamento live dell'anteprima (in millisecondi):"


; Info page
20500="Pannello titoli:"
20501="Stile:"
20502="Dim.:"
20503="B"
20504="I"
20505="Colore:"
20506="Disegna ombra:"
20507="Profondità:"
20508="Colore:"
20509="Mostra icona applicazione nel pannello titoli"
20510="Usa pannello titoli piccolo"
20511="Pannello informazioni:"
20512="Stile:"
20513="Dim.:"
20514="B"
20515="I"
20516="Colore:"
20517="Disegna ombra:"
20518="Profondità:"
20519="Colore:"
20520="Altezza:"
20521="Formato:"

; Info formats
20590="Nessuno"
20591="Solo numero applicazione"
20592="ID Processo"
20593="Nome Processo"
20594="Nome Processo [PID]"
20595="Descrizione programma"


; Hotkeys page
20600="Sostituisci il programma di gestione Alt-Tab standard di Windows "
20601="Attiva cambio istanza programma con Ctrl+Alt+[Shift]+Tab"
; or something like 20602="Don't hide TaskSwitchXP window on Alt releasing"
20602="Attiva modalità Alt-Tab \"sticky\""
; or something like 20603="Use low-level method to replace Alt-Tab"
20603="Usa metodo low-level per sostituire Alt-Tab"
20604="Controllo TaskSwitchXP:"
20605="Lista applicazioni:"
20606="Lista istanze programma:"
20607="Configura TaskSwitchXP:"
20608="Mostra/Nascondi icona su system tray:"
20609="Esci da TaskSwitchXP:"
20610="Hotkeys supplementari:"
20611="Minimizza finestra nel tray:"
20612="Ripristina dal tray:"


; Exclusions page
20700="Nuova..."
20701="Modifica..."
20702="Rimuovi"

; List groups
20780="Visualizzazione anteprima"
20781="Presentazione a video"

20790="Nome"
20791="Parametri"

; Advanced page
20800="Titoli finestre:"
20801="Usa titoli delle finestre dell'applicazione principale"
20802="Settaggi avanzati interfaccia:"
20803="Rimuovi pannello titoli"
20804="Rimuovi pannello informazioni"
20805="Azioni per l'icona nel tray:"
20806="Menu contestuale:"
20807="Configurazione:"
20808="Lista applicazioni:"
20809="Lista istanze programma:"
20810="Settaggi preferenze:"
20811="Mostra finestra preferenze \"always on top\""
20812="Ricorda l'ultima posizione della finestra preferenze"
20813="Ricorda l'ultima pagina della finestra preferenze"
20814="Avvia TaskSwitchXP all'apertura/chiusura"

; Tray icon actions
20890="Nessuna"
20891="Click tasto sinistro mouse"
20892="Doppio click tasto sinistro mouse"
20893="Click tasto centrale mouse"
20894="Doppio click tasto centrale mouse"
20895="Click tasto destro mouse"
20896="Doppio click tasto destro mouse"


; About page

; Information about you: contact email, website, etc.
; PLEASE NO COMMERCIAL ADS, ONLY YOUR PERSONAL INFORMATION!!!
;
; You can place here a text with two links in HTML format:
;   1) <a id=\"idTranslatorHome\" href=\"http://www.ntwind.com\">homepage</a>
;   2) <a id=\"idTranslatorMail\" href=\"mailto:alexander@ntwind.com">e-mail</a>
; Don't forget about special characters (like as \" and \\) in HTML tags, and 
; check out your links!
;
; You can also place here a salutation for TaskSwitchXP users!  ;)

20900="Tradotto da <a id=\"idTranslatorMail\" href=\"mailto:s.novella@libero.it\">Sergio Novella</a>...\r\nUtente TaskSwitchXP molto grato ad Alexander per il suo lavoro..."


; Exclusions dialog
22000="Esclusioni TaskSwitchXP"
22001="OK"
22002="Annulla"
22003="Applicazioni attive:
22004="Aggiorna"
22005="Nome esclusione:"
22006="Escludi per:"
22007="Nome processo:"
22008="Classe finestra:"
22009="Titolo finestra:"
22010="Escludi da:"
22011="visualizzazione anteprima"
22012="presentazione a video"
22013="Attivo"

22090="" ; not excluded
22091=">> escluso dall'anteprima"
22092=">> escluso dalla presentazione"

; Configurator Errors
30000="Errore di configurazione TaskSwitchXP"
30002="Impossibile avviare TaskSwitchXP.exe! Verificare l'installazione di TaskSwitchXP."
30003="Impossibile salvare impostazioni nel registro. Verificare i permessi di accesso."
30004="Impossibile caricare impostazioni da file."
30005="Impossibile caricare impostazioni da file. Ripristinate impostazioni di default."
30006="Impossibile salvare impostazioni su file."

; Hints for exclusion dialog
30100="Esclusione non identificata"
30101="Prego specificare un nome per l'esclusione."
30102="Nessun parametro"
30103="Prego specificare parametro/i dell'esclusione."
30104="Nessun nome processo"
30105="Prego specificare un nome di processo."
30106="Nessuna classe finestra"
30107="Prego specificare una classe di finestra."

; Confirmations
30900="Conferma TaskSwitchXP"
30901="TaskSwitchXP ha rilevato più di uno schermo display attivo sul tuo sistema.\r\nVuoi abilitare \"Window\" la visualizzazione delle anteprime sullo/i schermo/i secondario?"


; TaskSwitchXP Language Strings

; Tray menu
31000="Lista applicazioni"
31001="Lista istanze"	
31002="Preferenze..."
31003="Esci"

31020="Preferenze rapide"
31021="Nascondi l'icona del tray"
31022="Sostituisci Alt-Tab"
31023="Attiva lo switcher d'istanze"
31024="Attiva il modo Alt-Tab \"sticky\""
31025="Usa aggancio tastiera low-level"
31026="Nuova esclusione..."

31050="Aiuto"
31051="Documentazione"
31052="Home Page"
31053="Informazioni su TaskSwitchXP"

; Tray menu for minimized applications
31090="TSXP: %d app(s)"
31091="Ripristina tutto"
31092="Minimizza tutto"
31093="Chiudi tutto"
31094="Ripristina"
31095="Minimizza"
31096="Chiudi"

; Task List menu
31110="Passa a"
31111="Minimizza"
31112="Minimizza nel Tray"
31113="Affianca"
31114="Disponi in orizzontale"
31115="Disponi in verticale"
31116="Ripristina"
31117="Massimizza"
31118="Chiudi"
31119="Termina processo"

; Common menu
31150="Mostra informazioni processo"
31151="Seleziona tutto"
31152="Deseleziona tutto"
31153="Rimuovi selezionato"
31154="Ordina per titolo"
31155="Ordina per applicazione"	

; Process Info mask
; Here are used some terms from Windows Task Manager (Ctrl+Shift+Esc, Processes ; tab, View->Select Columns...)!
; WARNING: Don't replace %x special characters!!!
31500="Nome Immagine:  %s\r\nID Processo:  %u\r\n\r\nDurata:  %u:%02u:%02u\r\nTempo CPU:  %u:%02u:%02u\r\n\r\nUso Memoria:  %uK\r\nVM Dim.:  %uK"
31501="N/A" ; Informazioni sul processo non disponibili...

; Confirmations
31900="Conferma TaskSwitchXP"
31901="TaskSwitchXP è in esecuzione. Vuoi fermarlo?"
31902="Sei sicuro di voler uscire da TaskSwitchXP?"
31903="TaskSwitchXP ha rilevato che Ms PowerToy TaskSwitcher è in funzione.\r\nVuoi chiuderlo?"

; Errors
32000="Errore TaskSwitchXP"
32002="Inizializzazione fallita."
32003="Installazione aggancio tastiera low level fallita."
32004="Impossibile registrare l'hot key Alt+Tab o Alt+Shift+Tab.\r\nUn'altra applicazione ha già effettuato la registrazione."
32005="Impossibile registrare l'hot key Ctrl+Alt+Tab o Ctrl+Alt+Shift+Tab.\r\nUn'altra applicazione potrebbe già avere effettuato la registrazione."
32006="Impossibile avviare ConfigTsXP.exe! Verifica l'installazione di TaskSwitchXP."

32500="Impossibile registrare l'hot key:\r\n\r\nName: %s\r\nModifiers: %02X\r\nVirtual Code: %02X"
32501="Esci da TaskSwitchXP"
32502="Mostra/Nascondi icona del tray"
32503="Configura TaskSwitchXP"
32504="Lista applicazioni"
32505="Lista istanze"
32506="Minimizza finestra nel tray"
32507="Ripristina dal tray"
